app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-02-25 23:56:26.609266"], ["updated_at", "2020-02-25 23:56:26.609266"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Terrible Names"], ["room_number", 4], ["updated_at", "2020-02-26 00:09:05.174122"], ["id", 2]]